app/views/users/edit.html.erb

SELECT `interests`.* FROM `interests`
---
    <%= f.label :interests %><br />
    <%= f.select :interests, options_from_collection_for_select(Interest.all, :id, :text, @interest_list),{},{:multiple => true, :size => 5} %>

SELECT `expertises`.* FROM `expertises`
---
    <%= f.label :expertises %><br />
    <%= f.select :expertises, options_from_collection_for_select(Expertise.all, :id, :text, @expertise_list),{},{:multiple => true, :size => 5} %>

SELECT `institutions`.* FROM `institutions`
---
    <%= f.label :institutions %><br />
    <%= f.select :institutions, options_from_collection_for_select(Institution.all, :id, :text, @institution_list),{},{:multiple => true, :size => 5} %>