app/views/users/show.html.erb

    <ul>
      <% unless @user.interests.empty?%>
---
SELECT `interests`.* FROM `interests` INNER JOIN `interests_users` ON `interests`.`id` = `interests_users`.`interest_id` WHERE `interests_users`.`user_id` = 1

    <ul>
      <% unless @user.institutions.empty?%>
---
SELECT `institutions`.* FROM `institutions` INNER JOIN `institutions_users` ON `institutions`.`id` = `institutions_users`.`institution_id` WHERE `institutions_users`.`user_id` = 1

    <ul>
      <% unless @user.expertises.empty?%>
---
SELECT `expertises`.* FROM `expertises` INNER JOIN `expertises_users` ON `expertises`.`id` = `expertises_users`.`expertise_id` WHERE `expertises_users`.`user_id` = 1

    <ul>
      <% unless @user.documents.empty? %>
---
SELECT COUNT(*) FROM `documents` WHERE `documents`.`user_id` = 2
SELECT `documents`.* FROM `documents` WHERE `documents`.`user_id` = 21