app/controllers/documents_controller.rb

SELECT `documents`.* FROM `documents` WHERE `documents`.`id` = 11 LIMIT 1
---
  def show
    @document = Document.find(params[:id])