app/controllers/groups_controller.rb

  def show
    @group = Group.find(params[:id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 0 LIMIT 1

  def create
    @group = Group.new(params[:group])
    @group_membership = GroupMembership.create :group => @group, :user => current_user, :role => MembershipRoles.admin
---
INSERT INTO `group_memberships` (`created_at`, `group_id`, `role`, `updated_at`, `user_id`) VALUES ('2013-04-27 15:53:54', 5, 'admin', '2013-04-27 15:53:54', 21)
INSERT INTO `groups` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2013-04-21 20:26:07', 'The very first one!', 'first_group', '2013-04-21 20:26:07')

  def update
    @group = Group.find(params[:id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1