app/controllers/sessions_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`user_name` = 'jo' LIMIT 1
UPDATE `users` SET `tmp_password_hash` = '', `password_salt` = '$2a$10$5861uTUHpBKx.y9HnAo.2.', `password_hash` = '$2a$10$5861uTUHpBKx.y9HnAo.2./cfXOt5aARJdM8g86S5Mr1EYGjnK2pa', `updated_at` = '2013-04-24 00:34:17' WHERE `users`.`id` = 21
---
  def update_password
    u = User.authenticate User.find(params["id"]).user_name, params["curr"]
    if u && params["new"] == params["conf_new"]
      u.password = params["new"]
      u.tmp_password_hash = ""
      u.save