app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    params[:id] ||= current_user.id
    @document = Document.new
    @user = User.find(params[:id])

INSERT INTO `users` (`bio`, `city`, `created_at`, `email`, `expertises`, `institutions`, `interests`, `password_hash`, `password_salt`, `state`, `tmp_password_hash`, `updated_at`, `user_name`) VALUES ('bio', 'city', '2013-04-20 20:31:28', 'test', NULL, NULL, NULL, '', '', 'state', '', '2013-04-20 20:31:28', 'joe')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
      if @user.save

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
DELETE FROM `documents` WHERE `documents`.`id` = 1
UPDATE `users` SET `bio` = 'Joe is the most amazing thing since sliced bread', `city` = 'Baltimore', `state` = 'MD', `updated_at` = '2013-04-21 23:41:25' WHERE `users`.`id` = 2
---
  def update
    @user = User.find(User.parse_params_for_habtms(params)[:id])
    #Uploaded documents are not attributes of user and aren't updated as such
    if params[:user][:document]
      Document.upload_doc(params[:user][:document],current_user)
      params[:user].delete :document
    end

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT `users`.* FROM `users` WHERE `users`.`email` = 'test' LIMIT 1
UPDATE `users` SET `tmp_password_hash` = '$2a$10$kZ2mtFBiaEfSalzknVid/eirkWcEg/I7KrcpugmGfyBppqhlqnHL.', `updated_at` = '2013-04-23 00:24:56' WHERE `users`.`id` = 21
---
  def retrieve_pw
    o =  [('a'..'z'),('A'..'Z')].map{|i| i.to_a}.flatten
    tmp_pw  =  (0...15).map{ o[rand(o.length)] }.join
    user = User.find_by_email params[:email]
    if user
      user.tmp_password_hash = BCrypt::Engine.hash_secret(tmp_pw, user.password_salt)
      if user.save